11/data/attachments/548d8370fc355946.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_16ffd1cd-2474-4640-b54f-f2b435abd891</nif:username>
            <nif:friendToBeAdded>Michael_dog_Actions_81735_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>